{
  "problem": {
    "name": "polymer",
    "description": "# Overview\n\nCan your model unlock the secrets of polymers? In this competition, you're tasked with predicting the fundamental properties of polymers to speed up the development of new materials. Your contributions will help researchers innovate faster, paving the way for more sustainable and biocompatible materials that can positively impact our planet.\n\n# Description\nPolymers are the essential building blocks of our world, from the DNA within our bodies to the plastics we use every day. They are key to innovation in critical fields like medicine, electronics, and sustainability. The search for the next generation of groundbreaking, eco-friendly materials is on, and machine learning can be the solution. However, progress has been stalled by one major hurdle: a critical lack of accessible, high-quality data.\n\nOur Open Polymer Prediction 2025 introduces a game-changing, large-scale open-source dataset - ten times larger than any existing resource. We invite you to piece together the missing links and unlock the vast potential of sustainable materials.\n\nYour mission is to predict a polymer's real-world performance directly from its chemical structure. You'll be provided with a polymer's structure as a simple text string (SMILES), and your challenge is to build a model that can accurately forecast five key metrics that determine how it will behave. This includes predicting its density, its response to heat (thermal conductivity, Tc) and glass transition temperature (Tg), and its fundamental molecular size and packing efficiency (radius of gyration, Rg, and fractional free volume, FFV). The ground truth for this competition is averaged from multiple runs of molecular dynamics simulation.\n\nYour contributions have the potential to redefine polymer discovery, accelerating sustainable polymer research through virtual screening and driving significant advancements in materials science.\n\n# Evaluation Metric\n\nThe evaluation metric for this contest is a weighted Mean Absolute Error (wMAE) across five polymer properties, defined as:\n\n$$\n\\\\mathrm{wMAE}\n=\n\\\\frac{1}{\\\\lvert \\\\mathcal{X} \\\\rvert}\n\\\\sum_{X \\\\in \\\\mathcal{X}}\n\\\\sum_{i \\\\in I(X)}\nw_{i}\\\\,\\\\bigl\\\\lvert \\\\hat{y}_{i}(X) \\\\;-\\\\; y_{i}(X)\\\\bigr\\\\rvert\n$$\n\nTo ensure that all property types contribute equally regardless of their scale or frequency, each property is given a weight $w_{i}$:\n\n$$\n w_{i}\n=\n\\\\frac{1}{r_{i}}\n\\\\;\\\\times\\\\;\n\\\\frac{\n K\\\\,\\\\sqrt{\\\\tfrac{1}{n_{i}}}\n }{\n \\\\displaystyle\\\\sum_{j=1}^{K}\\\\sqrt{\\\\tfrac{1}{n_{j}}}\n }\n$$\n\n# Task\n\nIn this competition, your task is to use polymer structure data (SMILES) to predict five key chemical properties derived from molecular-dynamics simulation:\n\n- **Glass transition temperature** (`Tg`)\n- **Fractional free volume** (`FFV`)\n- **Thermal conductivity** (`Tc`)\n- **Polymer density** (`Density`)\n- **Radius of gyration** (`Rg`)\n\nSuccessfully predicting these properties is crucial for scientists to accelerate the design of novel polymers with targeted characteristics, which can be used in various applications.\n\n# Data Files\n\n### `train/valid/test.csv`\n\n| Column    | Description                                              |\n|-----------|----------------------------------------------------------|\n| `id`      | Unique identifier for each polymer.                      |\n| `SMILES`  | Sequence-like chemical notation of polymer structures.   |\n| `Tg`      | Glass transition temperature (°C).                       |\n| `FFV`     | Fractional free volume.                                  |\n| `Tc`      | Thermal conductivity (W/m·K).                            |\n| `Density` | Polymer density (g/cm³).                                 |\n| `Rg`      | Radius of gyration (Å).                                  |\n",
    "metric": "Combination of weighted MAE and R^2",
    "interface": "deepevolve_interface.py"
  },
  "initial_idea": {
    "title": "Graph Rationalization with Environment-based Augmentations",
    "content": "https://arxiv.org/abs/2206.02886",
    "supplement": "https://github.com/liugangcode/GREA"
  }
}
